---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementBoundaryOptions.Dispose
source: html/6e6b9488-0738-3f73-6def-43442b067428.htm
---
# Autodesk.Revit.DB.SpatialElementBoundaryOptions.Dispose Method

Releases all resources used by the SpatialElementBoundaryOptions

## Syntax (C#)
```csharp
public void Dispose()
```